logs/fio-diskseq/hpk/001/log006.txt
+ kubectl create --context '' namespace bench
namespace/bench created
+ kubectl create -n bench --context '' -f -
persistentvolumeclaim/claim1 created
+ kubectl create -n bench --context '' -f -
job.batch/fio created
+ kubectl wait --context '' --for=condition=complete --timeout=10h job/fio -n bench
job.batch/fio condition met
+ kubectl logs job/fio -n bench --context ''
Defaulted container "fio" out of: fio, init-container-resources (init)
INFO:    Converting SIF file to temporary sandbox...
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-write: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;88521;345;94764;0;0;0.000000;0.000000;73;207732;2883.207876;8351.176300;1.000000%=95;5.000000%=96;10.000000%=97;20.000000%=99;30.000000%=101;40.000000%=108;50.000000%=111;60.000000%=117;70.000000%=158;80.000000%=201;90.000000%=10682;95.000000%=14745;99.000000%=41680;99.500000%=53739;99.900000%=87556;99.950000%=103284;99.990000%=191889;0%=0;0%=0;0%=0;77;207736;2887.815733;8351.194201;4096;1255424;100.000000%;88681.650794;125906.673469;0.218440%;4.374070%;6129;2;156;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;23.64%;58.13%;0.11%;0.00%;0.00%;0.00%;0.00%;7.13%;8.73%;1.65%;0.55%;0.06%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;171;1527;0;0;4550;114550;119100;61.79%;slaves;4667;31939;517;3399;336697;321086;681994;96.81%;sda;4667;31939;517;3399;336697;321086;681994;96.81%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=361: Fri Nov 24 23:42:13 2023
  write: IOPS=345, BW=86.4MiB/s (90.6MB/s)(8192MiB/94764msec); 0 zone resets
    clat (usec): min=73, max=207732, avg=2883.21, stdev=8351.18
     lat (usec): min=77, max=207736, avg=2887.82, stdev=8351.19
    clat percentiles (usec):
     |  1.00th=[    96],  5.00th=[    97], 10.00th=[    98], 20.00th=[   100],
     | 30.00th=[   102], 40.00th=[   109], 50.00th=[   112], 60.00th=[   118],
     | 70.00th=[   159], 80.00th=[   202], 90.00th=[ 10683], 95.00th=[ 14746],
     | 99.00th=[ 41681], 99.50th=[ 53740], 99.90th=[ 87557], 99.95th=[103285],
     | 99.99th=[191890]
   bw (  KiB/s): min= 4096, max=1255424, per=100.00%, avg=88681.65, stdev=125906.67, samples=189
   iops        : min=   16, max= 4904, avg=346.41, stdev=491.82, samples=189
  lat (usec)   : 100=23.64%, 250=58.13%, 500=0.11%
  lat (msec)   : 10=7.13%, 20=8.73%, 50=1.65%, 100=0.55%, 250=0.06%
  cpu          : usr=0.22%, sys=4.37%, ctx=6129, majf=2, minf=156
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=86.4MiB/s (90.6MB/s), 86.4MiB/s-86.4MiB/s (90.6MB/s-90.6MB/s), io=8192MiB (8590MB), run=94764-94764msec

Disk stats (read/write):
    dm-2: ios=171/1527, merge=0/0, ticks=4550/114550, in_queue=119100, util=61.79%, aggrios=4667/31939, aggrmerge=517/3399, aggrticks=336697/321086, aggrin_queue=681994, aggrutil=96.81%
  sda: ios=4667/31939, merge=517/3399, ticks=336697/321086, in_queue=681994, util=96.81%
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-read: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-read;0;0;8388608;485030;1894;17295;0;0;0.000000;0.000000;34;97930;527.288647;2573.583783;1.000000%=35;5.000000%=35;10.000000%=36;20.000000%=36;30.000000%=37;40.000000%=37;50.000000%=37;60.000000%=38;70.000000%=40;80.000000%=45;90.000000%=60;95.000000%=1826;99.000000%=15400;99.500000%=15532;99.900000%=17956;99.950000%=20054;99.990000%=33816;0%=0;0%=0;0%=0;34;97930;527.342435;2573.582073;376832;540672;100.000000%;485648.441176;29813.399954;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.202382%;13.704175%;2496;0;73;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;82.64%;12.03%;0.02%;0.03%;0.02%;0.02%;1.01%;0.96%;0.89%;2.33%;0.05%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;2055;6;0;0;58016;152;58168;92.51%;slaves;33834;211;237;4;800404;4596;806569;99.43%;sda;33834;211;237;4;800404;4596;806569;99.43%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=403: Fri Nov 24 23:44:54 2023
  read: IOPS=1894, BW=474MiB/s (497MB/s)(8192MiB/17295msec)
    clat (usec): min=34, max=97930, avg=527.29, stdev=2573.58
     lat (usec): min=34, max=97930, avg=527.34, stdev=2573.58
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   36], 10.00th=[   37], 20.00th=[   37],
     | 30.00th=[   38], 40.00th=[   38], 50.00th=[   38], 60.00th=[   39],
     | 70.00th=[   41], 80.00th=[   46], 90.00th=[   61], 95.00th=[ 1827],
     | 99.00th=[15401], 99.50th=[15533], 99.90th=[17957], 99.95th=[20055],
     | 99.99th=[33817]
   bw (  KiB/s): min=376832, max=540672, per=100.00%, avg=485648.44, stdev=29813.40, samples=34
   iops        : min= 1472, max= 2112, avg=1897.06, stdev=116.46, samples=34
  lat (usec)   : 50=82.64%, 100=12.03%, 250=0.02%, 500=0.03%, 750=0.02%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=1.01%, 4=0.96%, 10=0.89%, 20=2.33%, 50=0.05%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.20%, sys=13.70%, ctx=2496, majf=0, minf=73
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=474MiB/s (497MB/s), 474MiB/s-474MiB/s (497MB/s-497MB/s), io=8192MiB (8590MB), run=17295-17295msec

Disk stats (read/write):
    dm-2: ios=2055/6, merge=0/0, ticks=58016/152, in_queue=58168, util=92.51%, aggrios=33834/211, aggrmerge=237/4, aggrticks=800404/4596, aggrin_queue=806569, aggrutil=99.43%
  sda: ios=33834/211, merge=237/4, ticks=800404/4596, in_queue=806569, util=99.43%
INFO:    Cleaning up image...
+ kubectl delete --context '' namespace bench
namespace "bench" deleted